{
  "contact.md": "---\ntitle: Contact\n---\n- 📧 [kramaiya3@gatech.edu](mailto:kramaiya3@gatech.edu)\n- 🔗 [linkedin.com/in/kushalramaiya](https://in.linkedin.com/in/kushal-ramaiya-402504179)\n- 💻 [github.com/ramaiyaKushal](https://github.com/ramaiyaKushal)\n",
  "education/bachelors.md": "---\ntitle: Bachelor of Science in Computer Science\n---\n## Bachelor of Science in Computer Science\n**University of Southampton, UK** · 2016 – 2019\n\n**Honours:** Upper Second Class\n\n**Key Courses**\n- Machine Learning Technology\n- Computer Vision\n- Cyber Security\n- Computational Biology\n- Advanced Databases\n- Intelligent Systems\n- Principles of Cyber Security\n",
  "education/masters.md": "---\ntitle: Master of Science in Computer Science\n---\n## Master of Science in Computer Science\n**Georgia Tech** · 2024 – Present\n\n**Specialization:** Machine Learning\n\n**Key Courses**\n- [CS 7638: Robotics – AI Techniques](https://omscs.gatech.edu/cs-7638-robotics-ai-techniques)\n- [CS 7646: Machine Learning for Trading](https://omscs.gatech.edu/cs-7646-machine-learning-trading)\n- [CS 6220: Big Data Systems & Analytics](https://oscar.gatech.edu/pls/bprod/bwckctlg.p_disp_course_detail?cat_term_in=202402&subj_code_in=CS&crse_numb_in=6220)\n- [CS 7641: Machine Learning](https://mahdi-roozbahani.github.io/CS46417641-fall2025/)\n- [CS 7632: Game AI](https://omscs.gatech.edu/cs-7632-game-ai)\n- [CS 7650: Natural Language Processing](https://cocoxu.github.io/CS7650_fall2025/)\n",
  "experience/machine-learning-engineer.md": "---\ntitle: Machine Learning Engineer\n---\n## Machine Learning Engineer\n**Augmont Enterprise** · April 2024 – Aug 2025 · `Python`\n\n- Designed and scaled enterprise AI/ML platforms leveraging LLMs, Generative AI, and modern MLOps for end-to-end business solutions.\n- Built RAG pipelines with LangChain, ChromaDB, and FAISS; integrated MLflow, Langfuse, and Open WebUI for orchestration, monitoring, and deployment on AWS.\n- Developed multi-LLM conversational AI (GPT-4o, Claude 3, Gemini, Mistral, LLaMA 3) via OpenRouter, providing internal teams with online access and OpenAI-compatible APIs for RAG-powered code generation.\n",
  "experience/software-development-engineer-1.md": "---\ntitle: Software Development Engineer 1\n---\n## Software Development Engineer 1\n**FactSet** · Aug 2019 – March 2020 · `C++`, `Python`, `Bash`\n\n- Contributed to the development and deployment of applications on remote RHEL 7 hosts, ensuring system reliability and efficiency.\n- Designed and implemented low-latency systems in C++ for delivering intraday messages, adhering to object-oriented programming principles.\n- Collaborated with team members to support the maintenance and development of market data solutions for Euronext.\n",
  "experience/software-development-engineer-2.md": "---\ntitle: Software Development Engineer 2\n---\n## Software Development Engineer 2\n**FactSet** · March 2020 – Feb 2021 · `C++`, `Bash`\n\n- Served as a market data feed engineer for **Euronext**, managing the largest European market data feed infrastructure to deliver high-performance, low-latency data solutions.\n- Maintained and improved the market data feed infrastructure by collaborating with cross-functional technology teams to ensure software and hardware adhered to the latest standards, practices, and performance benchmarks.\n- Investigated and resolved live issues in the production environment, minimizing downtime and ensuring uninterrupted data delivery for business-critical operations.\n- Enhanced infrastructure by contributing to debugging tools, deployment automation, monitoring systems, and configuration management to improve scalability, reliability, and efficiency.\n- Led efforts to acquire and integrate new data sources, coordinating with exchanges, third-party vendors, and internal teams to ensure data quality and smooth integration.\n",
  "home.md": "---\ntitle: Home\n---\n# Kushal Atul Ramaiya\n## Software Development Engineer\n\nPassionate about designing, refining, and deploying high-impact software solutions.\n\n> **Current Focus**  \n> Master of Science in Computer Science at Georgia Tech, specialization in Machine Learning.\n",
  "projects/full-stack-deep-learning.md": "---\ntitle: Full Stack Deep Learning Project\n---\n## Full Stack Deep Learning Project\n**Tech:** Deep Learning, MLOps\n\nView or download the presentation deck and explore the video walkthrough.\n\n- [Open Slides](/resume/FSDL-Project.pdf)\n\n<div style=\"margin-top: 1rem; width: 100%; height: 60vh;\">\n  <iframe\n    src=\"https://www.youtube.com/embed/mXEr2pbY0sE?list=PL1T8fO7ArWle-HwX6SkoQ3j_ol19P7tGT\"\n    title=\"Full Stack Deep Learning Project\"\n    frameborder=\"0\"\n    allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"\n    allowfullscreen\n    style=\"border: 1px solid #ccc; border-radius: 8px; width: 100%; height: 100%;\"\n  ></iframe>\n</div>\n\n<div style=\"margin-top: 1rem; width: 100%; height: 60vh;\">\n  <iframe\n    src=\"/resume/FSDL-Project.pdf\"\n    title=\"Full Stack Deep Learning Project PDF\"\n    width=\"100%\"\n    height=\"100%\"\n    style=\"border: 1px solid #ccc; border-radius: 8px;\"\n  ></iframe>\n</div>\n",
  "projects/hopscotch-kalman-filter.md": "---\ntitle: Hopscotch Kalman Filter\n---\n## Hopscotch Kalman Filter\n**Tech:** Machine Learning, Kalman Filter\n\n**Project:** Kalman Filter for Asteroid Navigation  \nImplemented a navigation system for a spaceship using a Kalman filter to estimate asteroid positions and plan safe jumps through a cosmic field.\n\n**Problem:** The spaceship could only jump within a limited radius and relied on noisy sensor measurements of asteroid locations. Invalid moves occurred if the ship tried to jump outside its range or beyond the field boundaries.\n\n**Approach:** Built a Kalman filter to predict asteroid trajectories from noisy observations. Designed a traversal algorithm to choose valid asteroids within range and navigate toward the home base.\n\n**Outcome:** The algorithm successfully guided the spaceship across moving asteroids, updating its position with true states after each jump while relying only on noisy observations for planning.\n\n<div class=\"media-container\">\n  <video controls class=\"media-player\">\n    <source src=\"/resume/Videos_RAIT/Hopscotch Kalman Filter.mov\" type=\"video/mp4\" />\n    <source src=\"/resume/Videos_RAIT/Hopscotch Kalman Filter.mov\" type=\"video/quicktime\" />\n    Your browser does not support the video tag.\n  </video>\n</div>\n",
  "projects/llm-fine-tuning.md": "---\ntitle: LLM Fine-Tuning Cohort\n---\n## LLM Fine-Tuning for Data Scientists and Software Engineers — Cohort-Based Learning\n**Tech:** Python  \n**Link:** [Course Details](https://maven.com/parlance-labs/fine-tuning)\n\nFine-tuning LLMs using Axolotl, setting up instrumentation, evaluating iterations, and deploying improved models.\n",
  "projects/ner-bilstm-cnn.md": "---\ntitle: Named Entity Recognition (NER) — BiLSTM-CNN PyTorch\n---\n## Named Entity Recognition (NER) — BiLSTM-CNN PyTorch\n**Tech:** Python, PyTorch, NLP, BiLSTM, CNN, CRF, GloVe, Named Entity Recognition\n\n**Overview:** Implemented a robust NER system that extracts named entities from raw text using a modern sequence-labeling pipeline combining pretrained GloVe embeddings, character-level CNNs, and a bidirectional LSTM. The system is trained and evaluated on the CoNLL-2003 English NER dataset.\n\n**Highlights**\n- **Architecture:** Character CNNs + BiLSTM\n- **Embeddings:** GloVe-based word vectors for better lexical generalization\n- **Data:** CoNLL-2003 (BIO tags); code prepares padding, batching, and character inputs\n- **Framework:** PyTorch training scripts and Jupyter notebook\n- **Artifacts:** Runnable notebook, saved model weights, and prediction files for evaluation\n\n**Results:** The pipeline reproduces strong baselines with typical dev/test F1 scores of ~0.90 / ~0.85 when fully trained.\n\n**Try it out:** Replace `\"Welcome to America\"` with your own text.\n\n```bash\ncurl -s -X POST \\\n  \"https://ramaiyakushal-ner-app--ner-model-api-predict-web.modal.run\" \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\"text\": \"Welcome to America\"}' \\\n  | python3 -m json.tool\n```\n",
  "projects/particle-filter-solar-system.md": "---\ntitle: Solar System Particle Filter\n---\n## Solar System Particle Filter\n**Tech:** Machine Learning, Kalman Filter\n\n**Project:** Particle Filter for Satellite Localization  \nImplemented a particle filter to localize a satellite in its home solar system using noisy gravimetric and illumination sensor data, enabling accurate positioning and communication.\n\n**Problem:** The satellite warped back into orbit with unknown position and orientation, limited resources, and only noisy gravitational/illumination measurements available. It needed to determine its location quickly and efficiently to survive and send rescue signals.\n\n**Approach:** Developed a particle filter that initialized candidate satellite positions, updated their weights based on noisy sensor data, resampled iteratively, and modeled orbital motion with Gaussian noise. Combined localization with planetary phase-angle calculations to determine the correct transmission direction.\n\n**Outcome:** The filter localized the satellite within 0.01 AU accuracy, operated under strict CPU time limits, and successfully enabled reliable SOS message transmission to the home planet.\n\n<div class=\"media-container\">\n  <video controls class=\"media-player\">\n    <source src=\"/resume/Videos_RAIT/Particle Filter.mov\" type=\"video/mp4\" />\n    <source src=\"/resume/Videos_RAIT/Particle Filter.mov\" type=\"video/quicktime\" />\n    Your browser does not support the video tag.\n  </video>\n</div>\n",
  "projects/pid-controller.md": "---\ntitle: PID Controller Project\n---\n## PID Controller Project\n**Tech:** Control Systems, Engineering\n\nImplementation and demonstration of a PID (Proportional-Integral-Derivative) controller system with simulation video.\n\n<div class=\"media-container\">\n  <video controls class=\"media-player\">\n    <source src=\"/resume/Videos_RAIT/PID.mov\" type=\"video/mp4\" />\n    <source src=\"/resume/Videos_RAIT/PID.mov\" type=\"video/quicktime\" />\n    Your browser does not support the video tag.\n  </video>\n</div>\n",
  "projects/slam-simulation.md": "---\ntitle: SLAM Simulation\n---\n## SLAM Simulation\n**Tech:** SLAM\n\n**Project:** SLAM and Path Planning for Drone Navigation  \nDeveloped a system for a drone to autonomously map a jungle environment filled with unknown obstacles and navigate to extract a hidden treasure.\n\n**Problem:** The drone entered a dense jungle with no prior knowledge of tree locations and had to rely on noisy sensor measurements. It needed to localize itself, map obstacles, and reach the treasure while avoiding collisions.\n\n**Approach:** Implemented a SLAM algorithm to estimate both drone and tree positions from noisy distance and bearing measurements. Designed a path-planning strategy that used SLAM outputs to generate safe movement commands within turning and distance constraints, checking potential collisions with line–circle intersection tests.\n\n**Outcome:** The system achieved accurate localization within 0.25m, successfully mapped obstacles, and navigated the drone to the treasure without collisions, completing the mission efficiently.\n\n<div class=\"media-container\">\n  <video controls class=\"media-player\">\n    <source src=\"/resume/Videos_RAIT/SLAM Video.mov\" type=\"video/mp4\" />\n    <source src=\"/resume/Videos_RAIT/SLAM Video.mov\" type=\"video/quicktime\" />\n    Your browser does not support the video tag.\n  </video>\n</div>\n",
  "projects/stock-market-forecasting.md": "---\ntitle: Stock Market Forecasting with CNN and News Sentiment Analysis\n---\n## Stock Market Forecasting with CNN and News Sentiment Analysis\n**Tech:** Python, Keras, CNN, NLP, Time Series\n\n**Project:** Stock Market Forecasting with CNN and News Sentiment Analysis  \nDeveloped and tuned multiple Convolutional Neural Network (CNN) architectures in Keras to predict Apple (AAPL) stock prices using historical indicators and news sentiment data.\n\n**Key Achievements**\n- Integrated sentiment scores from financial news (Intrino API + VADER NLP) with stock trading features (volume, open, high, low, change in value) for multivariate time-series forecasting.\n- Optimized hyperparameters (filters, kernel size, dense units) and trained using Adam optimizer with RMSE as the evaluation metric, achieving ~2 RMSE (≈3% error).\n- Demonstrated CNN's ability to capture complex temporal patterns, highlighting potential for broader applications in financial forecasting and multivariate time-series prediction.\n",
  "projects/trading-strategy-evaluation.md": "---\ntitle: Strategy Evaluation — Manual vs. Machine Learning Trading System\n---\n## Strategy Evaluation: Manual vs. Machine Learning Trading System\n**Tech:** Python, Machine Learning, Q-Learning, Reinforcement Learning, Backtesting, Hyperparameter Optimization, Financial Analysis  \n**Link:** [Project Slides](/resume/Project8.pdf)\n\n**Project Summary:** Developed and compared two algorithmic trading strategies for JPM stock using technical indicators (MACD, Bollinger Bands, Momentum). Implemented a manual rule-based strategy and a Q-Learning reinforcement learning model, evaluating performance across in-sample (2008–2009) and out-of-sample (2010–2011) periods with realistic transaction costs.\n\n**Key Achievements**\n- Designed a Q-Learning agent that achieved 242% cumulative return in-sample vs. 25% for manual strategy and 1% for benchmark.\n- Implemented a discretized state space (1000 states) using normalized and binned technical indicators to enable efficient reinforcement learning.\n- Conducted hyperparameter optimization through grid search across 2,500+ parameter combinations.\n- Analyzed impact of market friction on trading behavior, demonstrating inverse relationship between impact values and trade frequency.\n- Built complete backtesting framework with portfolio simulation accounting for commission ($9.95/trade) and market impact (0.5%).\n\n**Key Insight:** While the Q-Learner significantly outperformed during training, both strategies struggled in out-of-sample testing, highlighting the importance of model generalization and the challenges of overfitting in financial machine learning applications.\n",
  "projects/warehouse-search-planning.md": "---\ntitle: Warehouse Search Planning\n---\n## Warehouse Search Planning\n**Tech:** Search Algorithm, A Star Search\n\n**Project:** Warehouse Robot Path Planning with Deterministic and Stochastic Policies  \nBuilt algorithms for a warehouse robot to pick up and deliver boxes efficiently under conditions that included deterministic movement, uneven floor costs, and stochastic motion uncertainty.\n\n**Problem:** The robot had to collect and deliver boxes in the correct order within a grid-based warehouse, navigating around walls and minimizing total delivery costs. Challenges included limited cell access in the deterministic case, additional floor costs in uneven terrains, and uncertain robot movements due to stochastic effects.\n\n**Approach:** Designed efficient search-based algorithms to generate delivery plans under strict viewing constraints. Extended the solution with cost-aware pathfinding (similar to Dijkstra/A*) to handle varying floor costs. For stochastic environments, developed optimal policies that account for motion uncertainty using probability distributions, ensuring reliable pickup and delivery.\n\n**Outcome:** The system produced near-optimal delivery plans with minimal warehouse cell access, adapted to floor cost variations for reduced overall cost, and successfully generated robust stochastic policies that enabled the robot to complete deliveries despite uncertainty.\n\n<div class=\"media-container\">\n  <video controls class=\"media-player\">\n    <source src=\"/resume/Videos_RAIT/Warehouse Astar Search.mov\" type=\"video/mp4\" />\n    <source src=\"/resume/Videos_RAIT/Warehouse Astar Search.mov\" type=\"video/quicktime\" />\n    Your browser does not support the video tag.\n  </video>\n</div>\n",
  "skills/developer-tools.md": "---\ntitle: Developer Tools\n---\n## Developer Tools\n- Git\n- Docker\n- Google Cloud Platform\n- VS Code\n- Weights & Biases\n",
  "skills/frameworks.md": "---\ntitle: Frameworks\n---\n## Frameworks\n- Flask\n- FastAPI\n- JUnit\n- Jupyter Notebooks\n",
  "skills/languages.md": "---\ntitle: Languages\n---\n## Languages\n- Python\n- Java\n- SQL\n- C++\n"
}